#Вывести на экран таблицу умножения на 3

for i in range(1, 11):
    print(3,' * ', i, ' = ', 3 * i)